Pull request #70: doc: Extended documentation for gov internal and external setup EID-2779
Merge in EID/verifier-agent-oid4vp from EID-2779 to main

* commit '91ed6aca40000ce06e5e45074d1018c97ed816f4':
  doc: Extended swagger api documentation EID-2779
  doc: Extended documentation for gov internal and external setup EID-2779
