--- a/README.md
+++ b/README.md
@@ -13,40 +13,26 @@ instance of the service.
-
-## Overview
-
-```plantuml
-@startuml
-    [Verifier Business System] as issint
-    (Verifier Management Service) as isam
-    [(Postgres)] as isdb
-    (Verifier Validator Service) as isoi
-    [Wallet] as wallet
-
-    issint --> isam
-    isam --> isdb
-    isoi --> isdb
-    wallet --> isoi
-@enduml
+```mermaid
+flowchart TD
+    issint[\Verifier Business System\]
+    isam(Verifier Management Service)
+    isdb[(Postgres)]
+    isoi(Verifier Validator Service)
+    wallet[Wallet]
+    issint ---> isam
+    isam ---> isdb
+    isoi ---> isdb
+    wallet ---> isoi
 ```
+# Deployment
+For the deployment of the component please consult [deployment section of the verifier-agent-management](https://bitbucket.bit.admin.ch/projects/EID/repos/verifier-agent-management/browse)
+because it is the main interaction point with the issuer managent/oid4vci bundle
